<a href="https://colab.research.google.com/github/kikiru328/enterprise_analysis/blob/main/Membership.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# colab drive mount

import os, sys
from google.colab import drive
drive.mount('/content/drive')
my_path = '/content/notebooks'
os.symlink('/content/drive/My Drive/Colab Notebooks', my_path)
sys.path.insert(0,my_path)

Mounted at /content/drive

In [2]:
# Directory 변경 (모듈이용)
%pwd
%cd '../content/notebooks'
# module import
## Data Load
from pickle5 import pickle 

## Basic module
import pandas as pd
import numpy as np
import datetime as dt
import seaborn as sns
import matplotlib.pyplot as plt
plt.rc('font', family='NanumBarunGothic')

/content/drive/My Drive/Colab Notebooks

In [4]:
membership = pd.read_csv('/content/drive/MyDrive/공유문서/1차 프로젝트/5조/LOTT/멤버십여부.txt',encoding='cp949')
customer = pd.read_csv('/content/drive/MyDrive/공유문서/1차 프로젝트/5조/LOTT/고객DEMO.txt',encoding='cp949')
membership

       고객번호  멤버십명    가입년월
0        11  하이마트  201512
1        21  하이마트  201506
2        37  하이마트  201306
3        43  하이마트  201403
4        44  하이마트  201411
...     ...   ...     ...
7451  19377    롭스  201411
7452  19379    롭스  201412
7453  19380    롭스  201412
7454  19381   다둥이  201506
7455  19383    롭스  201507

[7456 rows x 3 columns]

In [7]:
membership = membership.sort_values(by='가입년월',ascending=True)

In [26]:
membership['가입개수'] = 1

In [32]:
membership

       고객번호  멤버십명    가입년월  가입개수
2666   8656    더영  201210     1
5632  14781    더영  201210     1
7008  18264    더영  201210     1
2882   9001    더영  201210     1
4892  13071    더영  201211     1
...     ...   ...     ...   ...
4799  12868    더영  201512     1
4794  12862  하이마트  201512     1
2658   8640  하이마트  201512     1
4766  12804  하이마트  201512     1
0        11  하이마트  201512     1

[7456 rows x 4 columns]

In [43]:
mg = membership.groupby(['고객번호','멤버십명'])[['멤버십명','가입년월','가입개수']].sum()
mg = mg.sort_values(by='가입개수',ascending=False)
mg

              가입년월  가입개수
고객번호  멤버십명
11    하이마트  201512     1
13229 더영    201508     1
13255 하이마트  201402     1
13249 하이마트  201502     1
      다둥이   201502     1
...            ...   ...
8288  다둥이   201504     1
8286  다둥이   201309     1
8284  다둥이   201307     1
8281  다둥이   201409     1
19383 롭스    201507     1

[7456 rows x 2 columns]

In [10]:
sns.barplot?